# Shared CLI tools — works on macOS and Linux via Homebrew

# Shell
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Core
brew "git"
brew "git-delta"       # better diffs (used in gitconfig)
brew "neovim"
brew "tmux"
brew "gh"              # GitHub CLI

# Search & navigation
brew "fzf"
brew "fd"              # used by fzf and telescope
brew "ripgrep"         # used by telescope/nvim
brew "zoxide"          # better cd

# Terminal enhancement
brew "eza"             # better ls
brew "bat"             # better cat
brew "starship"        # prompt

# Git tools
brew "lazygit"
brew "lazydocker"

# Python
brew "pyenv"
brew "uv"              # fast Python package manager

# Infrastructure
brew "terraform"

# Build tools
brew "cmake"
brew "llvm"            # clang-tidy and friends

# Node (version manager installed separately via bootstrap)
# nvm is installed via curl per nvm recommendations

# Google Cloud SDK is installed separately via bootstrap
