{
  "buckets": [
    { "Name": "main", "Source": "https://github.com/ScoopInstaller/Main" },
    { "Name": "extras", "Source": "https://github.com/ScoopInstaller/Extras" }
  ],
  "apps": [
    { "Name": "wezterm",   "Source": "extras", "Version": "current" },
    { "Name": "glazewm",   "Source": "extras", "Version": "current" },
    { "Name": "yasb",      "Source": "extras", "Version": "current" },
    { "Name": "git",       "Source": "main",   "Version": "current" },
    { "Name": "neovim",    "Source": "main",   "Version": "current" },
    { "Name": "lazygit",   "Source": "main",   "Version": "current" },
    { "Name": "fzf",       "Source": "main",   "Version": "current" },
    { "Name": "fd",        "Source": "main",   "Version": "current" },
    { "Name": "ripgrep",   "Source": "main",   "Version": "current" },
    { "Name": "zoxide",    "Source": "main",   "Version": "current" },
    { "Name": "eza",       "Source": "main",   "Version": "current" },
    { "Name": "bat",       "Source": "main",   "Version": "current" },
    { "Name": "starship",  "Source": "main",   "Version": "current" },
    { "Name": "terraform", "Source": "main",   "Version": "current" },
    { "Name": "cmake",     "Source": "main",   "Version": "current" },
    { "Name": "gh",        "Source": "main",   "Version": "current" }
  ]
}
